# RemoveInsulationType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..RemoveInsulationType Method
TemperatureRatingType Class See Also
---
Remove an existing insulation type from this temperature rating type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveInsulationType(
	InsulationType insulationType
)
```

Visual Basic
---
```text
Public Sub RemoveInsulationType ( _
	insulationType As InsulationType _
)
```

Visual C++
---
```text
public:
void RemoveInsulationType(
	InsulationType^ insulationType
)
```

# ### Parameters
insulationType
    Type: Autodesk.Revit.DB.Electrical..::..InsulationTypeInsulation type to be removed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The last one insulation type of project and any one which is in use by a wire type can't be removed. |

# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace